
{
    "drummers": [{
      "index": 0,
      "name": "John Bonham",
      "shortname" : "bonham",
      "description": "<p>John Bonham is the most influential Rock Drummer of all-time.</p><p>Describing the style of John Bonham's drumming instantly conjurs up visions of the thunderous power he created. His contributions to rock music were revolutionary, and his talent unmatched and irreplaceable. You can only imagine Jimmy Page's reaction to first seeing him in 1968, ending his search for a new drummer to form a new band, the New Yardbirds (later renamed Led Zeppelin.)</p> <p>A childhood friend of Robert Plant, they played together in the 'Band of Joy', resulting in local gigs and a few studio demos. At first, Bonham was reluctant to join the well-known guitarist because of a steady gig with Tim Rose. But... the rest of history...</p> <p>As John Paul Jones, Jimmy Page and Robert Plant have all stated many times, Led Zeppelin wouldn't have been half as good without him. Along with JPJ, they provided the solid foundation and backbone of the band, which made it all possible. Live performances truly showcased his abilities during the numerous improvised jams throughout every concert and of course his famous 'Moby Dick' drum solo; reaching a half-hour in length at times! Immitators are usually left frustrated, since Bonham made it look so easy - not only in his playing but also in the incredible drum sound he acheived. His legendary right foot (on his bass pedal) and lightning-fast triplets were his instant trademark. He later refined his style from the hard skin-bashing approach to a more delicate wrist controlled one - which produced an even more powerful & louder sound with less effort.</p> <p>His tragic passing on September 25th, 1980 immortalized his legacy forever. His only son, Jason proudly continues the tradition.</p>",
      "artwork": ["john_bonham.jpg"]
    },{
      "index": 1,
      "name": "Vinnie Colaiuta",
      "shortname" : "vinnie",
      "description": "<p>Vincent Colaiuta is a highly regarded drummer based in Los Angeles. Originally from Brownsville, Pennsylvania, he began playing drums as a child and received his first full drum kit from his parents at the age of 14.</p> <p>After attending the Berklee College of Music in Boston for a year, Colaiuta relocated to Los Angeles and made a mediocre living playing with lounge bands. His break came in April 1978 at the age of 22, when he auditioned for Frank Zappa, an audition that involved performing the notoriously difficult piece entitled ìThe Black Pageî. The audition was successful and Colaiuta went on to work with Zappa as his principal drummer for studio and live performances.</p> <p>Colaiuta's performances on Zappa's albums Tinsel Town Rebellion, Joe's Garage and Shut Up 'n Play Yer Guitar are considered by many drummers to be among the most astounding ever recorded. Joe's Garage was named one of the top-25 drumming performances of all time in a 1993 Modern Drummer article.</p> <p>After leaving Zappa, Colaiuta went on to work with a long list of notable rock and pop artists, including Gino Vannelli, Joni Mitchell, Barbra Streisand, Sandy & Junior, Clannad, Wang Chung, Chaka Khan, and Jeff Beck. He has also appeared with many notable jazz musicians, including Chick Corea, Herbie Hancock, Jimmy Haslip, Quincy Jones, the Buddy Rich Big Band and Buell Neidlinger.</p> <p>In 1990, Colaiuta successfully auditioned for the drum spot in Sting's touring band in support of his album The Soul Cages. Colaiuta remained as a member of Sting's band for the next seven years. He declined the offer to go out on the road for the Brand New Day tour in 1999 due to the unusually grueling amount of time that Sting prefers to cover the globe.</p><p>Colaiuta's studio work with Sting can be heard on Ten Summoner's Tales (1993), Mercury Falling (1996), three songs on Brand New Day (1999) and two songs on Sacred Love (2003). In September of 2003, Vinnie returned to Sting's touring lineup in a brief promotional tour of Sacred Love, but once again declined the offer to participate in the world tour.</p><p>Colaiuta released a self-titled solo recording in 1994, and still remains one of the most in demand studio musicians playing on countless albums, film soundtracks, TV and radio jingles.</p> <p>In 2006-07, Colaiuta toured with ﻿Jeff Beck and ﻿Tal Wilkenfeld on bass, with ﻿Jason Rebello playing keyboards, in ﻿Eric Clapton's ﻿Crossroads Guitar Festival. He has recorded and performed with artists as diverse as ﻿country artist ﻿Faith Hill, whom he toured with and played on the albums ﻿Cry and ﻿Fireflies, ﻿thrash metal outfit ﻿Megadeth on their album ﻿The System Has Failed and jazz musician ﻿Herbie Hancock.</p> <p>Vinnie played Yamaha Drums for more than 10 years during the 80's. Then in the early 90's, he switched to Gretsch Drums. In 2012 he switched to Ludwig Drums, and then to Heuer Drums in 2014. On June 2016 Vinnie is returning to play Gretsch drums again....</p>",
      "artwork" : ["vinnie.jpg"]
    },{
      "index": 2,
      "name": "Carter Beauford",
      "shortname" : "carter",
      "description": "<p>Carter Beauford grew up in a household full of music. Everything from jazz, gospel to the Beatles was played.</p> <p>For Carter Beauford, it all started when he was three years old. His father was going to a Buddy Rich concert, but he couldn't find a babysitter for young Carter. His only solution was to take Carter with him. From the moment Carter laid eyes and ears upon Buddy Rich, he was enthralled and facinated with Rich.</p> <p>After the concert, the young Carter took up drums and wanted to emulate Buddy Rich. I guess you could call Buddy Rich Carter's idol when he was a young lad. Upon hearing his son's playing, Carter's father was impressed and bought him a Roy Rogers drum kit made with paper heads and tin shells. This was all Carter needed. So thank Carter's father for bringing this wonderful drummer into the world!</p> <p>During those young years, Carter's major influences were Tony Williams, Papa Jo Jones, and of course, Buddy Rich.</p> <p>Throughtout his career, Carter has played with many different bands with various musical styles. Carter feels it is important to have an open mind musically and to expose oneself to different forms of music.</p> <p>One band, besides the Dave Matthews Band, that Carter is very proud of was called, Secrets. This band played the Richmond, Virginia area and was composed of many talented musicians, including Carter on the drums. After this band dissolved, Carter went to California to try out for the Arsenio Hall show. For whatever reason, the Show didn't want Carter, so he moved back to Virginia; which is where the next chapter of his life starts.</p>",
      "artwork" : ["carter.jpg"]
    },{
      "index": 3,
      "name": "Brian Blade",
      "shortname" : "brian",
      "description": "<p>Louisiana-born, Brian Blade grew up in Shreveport, then New Orleans, where he distilled the unique drumming styles and musical heritage of the nation's spiritual underbelly into a powerfully swinging percussive trademark. Nurtured under the watchful eyes of Ellis Marsalis and New Orleans Dixie-drum masters Johnny Vidacovich and Herlin Riley, Blade learned to find his 'knit in the blanket' of sounds and styles.</p> <p>From albums and tours with Joshua Redman and Kenny Garrett, to recent recordings with Bob Dylan (Time Out Of Mind), Emmylou Harris (Wrecking Ball), Daniel Lanois (Sling Blade) and hero Joni Mitchell, Brian has shown deep musical instincts and a phenomenal gift for playing music texturally -- both thick and thin -- on the drums. His evolution continues on his astounding, highly acclaimed Blue Note debut, Brian Blade Fellowship. The line-up of Fellowship, Brian's band, is as potent as its leader's musical skills: Jon Cowherd, piano and Wurlitzer, Christopher Thomas on bass, Melvin Butler, tenor and soprano sax, Myron Walden, alto sax, Jeff Parker, guitar; and Dave Easley, pedal steel guitar. This self-titled album was produced by Daniel Lanois who also guested on the album playing mando-guitar and Fender Mustang guitar; Mark Howard recorded and mixed at The Teatro in Oxnard, California.</p> <p>Brian Blade makes music that exists beyond borders. Spirituality, sensitivity, honesty, loyalty, all these traits feed the theme of the Brian Blade Fellowship. 'I want the music to be a fellowship. That's what you want from the world as a whole. I want the music to project that kind of togetherness. This ideal of fellowship is something I grew up with. I just want to extend the good memories.'</p>",
      "artwork" : ["brian.jpg"]
    },{
      "index": 4,
      "name": "Steve Gadd",
      "shortname" : "steve",
      "description": "<p>One of the most influential drummers of all time, Steve Gadd set a new standard in contemporary drumming techniques and performance, and in doing so launched a thousand imitators. Recording so many legendary drum tracks like; 'Aja','Fifty Ways to Leave Your Lover' and 'Nite Sprite', there is no drummer alive today who in some way has not been effected by Steve Gadd. His influence is still very much felt and can be heard in the playing of everyone from Vinnie Colaiuta to Carter Beauford. And still to this day there is no one who can get 'inside' a tune and find the 'pocket' quite like the great Steve Gadd.</p> <p>Steve Gadd was born in Rochester, New York, April 9, 1945.</p> <p>Steve's Uncle, a drummer in the army, encouraged him to take drum lessons at the age of seven; by the time Steve was 11 he had sat in with Dizzy Gillespie. Studied music at Eastman College, Rochester, playing in wind ensemble and concert band, and at nights in a club with Chick Corea, Chuck Mangione, Joe Romano and Frank Pullara. After college, drafted into army and spent three years in a military band. </p> <p>After the army he gigged and worked with a big band in Rochester. 1972 he formed a trio with Tony Levin and Mike Holmes, going to New York with it. The trio fizzled out, but Gadd began to work extensively as a studio musician. </p> <p>He also played with Corea's first Return to Forever. 1970's and 1980's, toured internationally, recorded with Paul Simon and with Al DiMeola's Electric Rendezvous Band.</p> <p>In 1976 Steve became a member of the group Stuff with Gordon Edwards, Richard Tee, Eric Gale, Cornell Dupree and Chris Parker, while continuing his heavy schedule of studio work. Towards the end of the 70's, Steve had not only become one of the most in-demand drummers, but he had also become one of the most imitated, and revered drummers in the world.</p> <p>In Japan transcriptions of his solos were on sale, and all the leading Japanese drummers were sounding like him. Chick Corea commented, 'Every drummer wants to play like Gadd because he plays perfect . . . He has brought orchestral and compositional thinking to the drum kit while at the same time having a great imagination and a great ability to swing.'</p> <p>The 90's saw Steve become Eric Clapton's first call drummer, solidifying Steve's reputation as one of the most accomplished and skilled drummers of his generation.</p> <p>Today Steve is just as busy as he ever was with one of the most intense recording and touring schedules in the business, spending time in the studio and on the road with Eric Clapton, Paul Simon and James Taylor.</p> <p>Steve's influence on the drumming community can be heard in players from all walks of life, whether they know it or not. His feel, imagination, and abilities are the signatures of his trademark sound. Few others can manage to get inside a tune like Steve Gadd.</p> ",
      "artwork" : ["steve.jpg"]
    },{
      "index": 5,
      "name": "Stewart Copeland",
      "shortname" : "stewart",
      "description": "<p>After rising to international stardom with the Police, Stewart Copeland largely rejected his pop music past to pursue a career as a composer, authoring a prolific series of film scores, operas, and ballets.</p> <p>Born July 16, 1952 in Alexandria, Copeland - the son of a CIA agent - spent his formative years in the Middle East but attended college in California before settling in England in 1975 and playing drums with the progressive rock unit Curved Air.</p> <p>Following the group's dissolution, he founded the Police with singer/bassist Sting and guitarist Henri Padovani (the latter soon replaced by Andy Summers). Beginning with their first hit, 1979's 'Roxanne,' the trio emerged as one of the most popular and innovative bands of the post-punk era, drawing upon reggae, funk, and world music to create a uniquely infectious yet cerebral brand of pop which generated a series of smash singles including 'Every Little Thing She Does Is Magic,' 'Every Breath You Take,' and 'King of Pain.' While with the Police, Copeland -- who in 1980 issued a solo record, Music Madness from the Kinetic Kid, under the alias Klark Kent -- not only earned wide critical acclaim for his intricate, textured drumwork, but he contributed many of the group's songs as well.</p> <p>At the peak of their commercial success, the Police disbanded after touring in support of the 1983 blockbuster Synchronicity; by that time Copeland was already established as a film composer, however, earning a Golden Globe nomination for his score to Francis Ford Coppola's Rumble Fish. In 1985 he released The Rhythmatist, the product of his musical pilgrimage to Africa, followed by an ever-increasing number of film scores including a pair of Oliver Stone features, Wall Street and Talk Radio, in addition to acclaimed projects like Ken Loach's Raining Stones, Four Days in September and West Beirut as well as many more mainstream Hollywood productions.</p> <p>Copeland's other work includes a stint with the pop-fusion trio Animal Logic as well as authoring the San Francisco Ballet's King Lear, the Cleveland Opera's Holy Blood and Crescent Moon, and Ballet Oklahoma's Prey.</p> <p>Stewart appeared at the Modern Drummer Festival 2006...</p>",
      "artwork" : ["stewart.jpg"]
    }]
  }