
{
    "drummers": [{
      "name": "John Bonham",
      "shortname" : "john_bonham",
      "description": "<p>John Bonham is the most influential Rock Drummer of all-time.</p><p>Describing the style of John Bonham's drumming instantly conjurs up visions of the thunderous power he created. His contributions to rock music were revolutionary, and his talent unmatched and irreplaceable. You can only imagine Jimmy Page's reaction to first seeing him in 1968, ending his search for a new drummer to form a new band, the New Yardbirds (later renamed Led Zeppelin.)</p> <p>A childhood friend of Robert Plant, they played together in the 'Band of Joy', resulting in local gigs and a few studio demos. At first, Bonham was reluctant to join the well-known guitarist because of a steady gig with Tim Rose. But... the rest of history...</p> <p>As John Paul Jones, Jimmy Page and Robert Plant have all stated many times, Led Zeppelin wouldn't have been half as good without him. Along with JPJ, they provided the solid foundation and backbone of the band, which made it all possible. Live performances truly showcased his abilities during the numerous improvised jams throughout every concert and of course his famous 'Moby Dick' drum solo; reaching a half-hour in length at times! Immitators are usually left frustrated, since Bonham made it look so easy - not only in his playing but also in the incredible drum sound he acheived. His legendary right foot (on his bass pedal) and lightning-fast triplets were his instant trademark. He later refined his style from the hard skin-bashing approach to a more delicate wrist controlled one - which produced an even more powerful & louder sound with less effort.</p> <p>His tragic passing on September 25th, 1980 immortalized his legacy forever. His only son, Jason proudly continues the tradition.</p>",
      "artwork": ["john_bonham.jpg"]
    },{
      "name": "Vinnie Colaiuta",
      "shortname" : "vinnie",
      "description": "<p>Vincent Colaiuta is a highly regarded drummer based in Los Angeles. Originally from Brownsville, Pennsylvania, he began playing drums as a child and received his first full drum kit from his parents at the age of 14.</p> <p>After attending the Berklee College of Music in Boston for a year, Colaiuta relocated to Los Angeles and made a mediocre living playing with lounge bands. His break came in April 1978 at the age of 22, when he auditioned for Frank Zappa, an audition that involved performing the notoriously difficult piece entitled ìThe Black Pageî. The audition was successful and Colaiuta went on to work with Zappa as his principal drummer for studio and live performances.</p> <p>Colaiuta's performances on Zappa's albums Tinsel Town Rebellion, Joe's Garage and Shut Up 'n Play Yer Guitar are considered by many drummers to be among the most astounding ever recorded. Joe's Garage was named one of the top-25 drumming performances of all time in a 1993 Modern Drummer article.</p> <p>After leaving Zappa, Colaiuta went on to work with a long list of notable rock and pop artists, including Gino Vannelli, Joni Mitchell, Barbra Streisand, Sandy & Junior, Clannad, Wang Chung, Chaka Khan, and Jeff Beck. He has also appeared with many notable jazz musicians, including Chick Corea, Herbie Hancock, Jimmy Haslip, Quincy Jones, the Buddy Rich Big Band and Buell Neidlinger.</p> <p>In 1990, Colaiuta successfully auditioned for the drum spot in Sting's touring band in support of his album The Soul Cages. Colaiuta remained as a member of Sting's band for the next seven years. He declined the offer to go out on the road for the Brand New Day tour in 1999 due to the unusually grueling amount of time that Sting prefers to cover the globe.</p><p>Colaiuta's studio work with Sting can be heard on Ten Summoner's Tales (1993), Mercury Falling (1996), three songs on Brand New Day (1999) and two songs on Sacred Love (2003). In September of 2003, Vinnie returned to Sting's touring lineup in a brief promotional tour of Sacred Love, but once again declined the offer to participate in the world tour.</p><p>Colaiuta released a self-titled solo recording in 1994, and still remains one of the most in demand studio musicians playing on countless albums, film soundtracks, TV and radio jingles.</p> <p>In 2006-07, Colaiuta toured with ﻿Jeff Beck and ﻿Tal Wilkenfeld on bass, with ﻿Jason Rebello playing keyboards, in ﻿Eric Clapton's ﻿Crossroads Guitar Festival. He has recorded and performed with artists as diverse as ﻿country artist ﻿Faith Hill, whom he toured with and played on the albums ﻿Cry and ﻿Fireflies, ﻿thrash metal outfit ﻿Megadeth on their album ﻿The System Has Failed and jazz musician ﻿Herbie Hancock.</p> <p>Vinnie played Yamaha Drums for more than 10 years during the 80's. Then in the early 90's, he switched to Gretsch Drums. In 2012 he switched to Ludwig Drums, and then to Heuer Drums in 2014. On June 2016 Vinnie is returning to play Gretsch drums again....</p>",
      "artwork" : ["vinnie.jpg"]
    },{
      "name": "Carter Beauford",
      "shortname" : "carter",
      "description": "<p>Carter Beauford grew up in a household full of music. Everything from jazz, gospel to the Beatles was played.</p> <p>For Carter Beauford, it all started when he was three years old. His father was going to a Buddy Rich concert, but he couldn't find a babysitter for young Carter. His only solution was to take Carter with him. From the moment Carter laid eyes and ears upon Buddy Rich, he was enthralled and facinated with Rich.</p> <p>After the concert, the young Carter took up drums and wanted to emulate Buddy Rich. I guess you could call Buddy Rich Carter's idol when he was a young lad. Upon hearing his son's playing, Carter's father was impressed and bought him a Roy Rogers drum kit made with paper heads and tin shells. This was all Carter needed. So thank Carter's father for bringing this wonderful drummer into the world!</p> <p>During those young years, Carter's major influences were Tony Williams, Papa Jo Jones, and of course, Buddy Rich.</p> <p>Throughtout his career, Carter has played with many different bands with various musical styles. Carter feels it is important to have an open mind musically and to expose oneself to different forms of music.</p> <p>One band, besides the Dave Matthews Band, that Carter is very proud of was called, Secrets. This band played the Richmond, Virginia area and was composed of many talented musicians, including Carter on the drums. After this band dissolved, Carter went to California to try out for the Arsenio Hall show. For whatever reason, the Show didn't want Carter, so he moved back to Virginia; which is where the next chapter of his life starts.</p>",
      "artwork" : ["carter.jpg"]
    }]
  }