
{
    "drummers": [{
      "index": 0,
      "name": "John Bonham",
      "shortname" : "bonham",
      "description": " John Bonham is the most influential Rock Drummer of all-time.   Describing the style of John Bonham's drumming instantly conjurs up visions of the thunderous power he created. His contributions to rock music were revolutionary, and his talent unmatched and irreplaceable. You can only imagine Jimmy Page's reaction to first seeing him in 1968, ending his search for a new drummer to form a new band, the New Yardbirds (later renamed Led Zeppelin.)    A childhood friend of Robert Plant, they played together in the 'Band of Joy', resulting in local gigs and a few studio demos. At first, Bonham was reluctant to join the well-known guitarist because of a steady gig with Tim Rose. But... the rest of history...    As John Paul Jones, Jimmy Page and Robert Plant have all stated many times, Led Zeppelin wouldn't have been half as good without him. Along with JPJ, they provided the solid foundation and backbone of the band, which made it all possible. Live performances truly showcased his abilities during the numerous improvised jams throughout every concert and of course his famous 'Moby Dick' drum solo; reaching a half-hour in length at times! Immitators are usually left frustrated, since Bonham made it look so easy - not only in his playing but also in the incredible drum sound he acheived. His legendary right foot (on his bass pedal) and lightning-fast triplets were his instant trademark. He later refined his style from the hard skin-bashing approach to a more delicate wrist controlled one - which produced an even more powerful & louder sound with less effort.    His tragic passing on September 25th, 1980 immortalized his legacy forever. His only son, Jason proudly continues the tradition.  ",
      "artwork": ["john_bonham.jpg"]
    },{
      "index": 1,
      "name": "Vinnie Colaiuta",
      "shortname" : "vinnie",
      "description": " Vincent Colaiuta is a highly regarded drummer based in Los Angeles. Originally from Brownsville, Pennsylvania, he began playing drums as a child and received his first full drum kit from his parents at the age of 14.    After attending the Berklee College of Music in Boston for a year, Colaiuta relocated to Los Angeles and made a mediocre living playing with lounge bands. His break came in April 1978 at the age of 22, when he auditioned for Frank Zappa, an audition that involved performing the notoriously difficult piece entitled ìThe Black Pageî. The audition was successful and Colaiuta went on to work with Zappa as his principal drummer for studio and live performances.    Colaiuta's performances on Zappa's albums Tinsel Town Rebellion, Joe's Garage and Shut Up 'n Play Yer Guitar are considered by many drummers to be among the most astounding ever recorded. Joe's Garage was named one of the top-25 drumming performances of all time in a 1993 Modern Drummer article.    After leaving Zappa, Colaiuta went on to work with a long list of notable rock and pop artists, including Gino Vannelli, Joni Mitchell, Barbra Streisand, Sandy & Junior, Clannad, Wang Chung, Chaka Khan, and Jeff Beck. He has also appeared with many notable jazz musicians, including Chick Corea, Herbie Hancock, Jimmy Haslip, Quincy Jones, the Buddy Rich Big Band and Buell Neidlinger.    In 1990, Colaiuta successfully auditioned for the drum spot in Sting's touring band in support of his album The Soul Cages. Colaiuta remained as a member of Sting's band for the next seven years. He declined the offer to go out on the road for the Brand New Day tour in 1999 due to the unusually grueling amount of time that Sting prefers to cover the globe.   Colaiuta's studio work with Sting can be heard on Ten Summoner's Tales (1993), Mercury Falling (1996), three songs on Brand New Day (1999) and two songs on Sacred Love (2003). In September of 2003, Vinnie returned to Sting's touring lineup in a brief promotional tour of Sacred Love, but once again declined the offer to participate in the world tour.   Colaiuta released a self-titled solo recording in 1994, and still remains one of the most in demand studio musicians playing on countless albums, film soundtracks, TV and radio jingles.    In 2006-07, Colaiuta toured with ﻿Jeff Beck and ﻿Tal Wilkenfeld on bass, with ﻿Jason Rebello playing keyboards, in ﻿Eric Clapton's ﻿Crossroads Guitar Festival. He has recorded and performed with artists as diverse as ﻿country artist ﻿Faith Hill, whom he toured with and played on the albums ﻿Cry and ﻿Fireflies, ﻿thrash metal outfit ﻿Megadeth on their album ﻿The System Has Failed and jazz musician ﻿Herbie Hancock.    Vinnie played Yamaha Drums for more than 10 years during the 80's. Then in the early 90's, he switched to Gretsch Drums. In 2012 he switched to Ludwig Drums, and then to Heuer Drums in 2014. On June 2016 Vinnie is returning to play Gretsch drums again....  ",
      "artwork" : ["vinnie.jpg"]
    },{
      "index": 2,
      "name": "Carter Beauford",
      "shortname" : "carter",
      "description": " Carter Beauford grew up in a household full of music. Everything from jazz, gospel to the Beatles was played.    For Carter Beauford, it all started when he was three years old. His father was going to a Buddy Rich concert, but he couldn't find a babysitter for young Carter. His only solution was to take Carter with him. From the moment Carter laid eyes and ears upon Buddy Rich, he was enthralled and facinated with Rich.    After the concert, the young Carter took up drums and wanted to emulate Buddy Rich. I guess you could call Buddy Rich Carter's idol when he was a young lad. Upon hearing his son's playing, Carter's father was impressed and bought him a Roy Rogers drum kit made with paper heads and tin shells. This was all Carter needed. So thank Carter's father for bringing this wonderful drummer into the world!    During those young years, Carter's major influences were Tony Williams, Papa Jo Jones, and of course, Buddy Rich.    Throughtout his career, Carter has played with many different bands with various musical styles. Carter feels it is important to have an open mind musically and to expose oneself to different forms of music.    One band, besides the Dave Matthews Band, that Carter is very proud of was called, Secrets. This band played the Richmond, Virginia area and was composed of many talented musicians, including Carter on the drums. After this band dissolved, Carter went to California to try out for the Arsenio Hall show. For whatever reason, the Show didn't want Carter, so he moved back to Virginia; which is where the next chapter of his life starts.  ",
      "artwork" : ["carter.jpg"]
    },{
      "index": 3,
      "name": "Brian Blade",
      "shortname" : "brian",
      "description": " Louisiana-born, Brian Blade grew up in Shreveport, then New Orleans, where he distilled the unique drumming styles and musical heritage of the nation's spiritual underbelly into a powerfully swinging percussive trademark. Nurtured under the watchful eyes of Ellis Marsalis and New Orleans Dixie-drum masters Johnny Vidacovich and Herlin Riley, Blade learned to find his 'knit in the blanket' of sounds and styles.    From albums and tours with Joshua Redman and Kenny Garrett, to recent recordings with Bob Dylan (Time Out Of Mind), Emmylou Harris (Wrecking Ball), Daniel Lanois (Sling Blade) and hero Joni Mitchell, Brian has shown deep musical instincts and a phenomenal gift for playing music texturally -- both thick and thin -- on the drums. His evolution continues on his astounding, highly acclaimed Blue Note debut, Brian Blade Fellowship. The line-up of Fellowship, Brian's band, is as potent as its leader's musical skills: Jon Cowherd, piano and Wurlitzer, Christopher Thomas on bass, Melvin Butler, tenor and soprano sax, Myron Walden, alto sax, Jeff Parker, guitar; and Dave Easley, pedal steel guitar. This self-titled album was produced by Daniel Lanois who also guested on the album playing mando-guitar and Fender Mustang guitar; Mark Howard recorded and mixed at The Teatro in Oxnard, California.    Brian Blade makes music that exists beyond borders. Spirituality, sensitivity, honesty, loyalty, all these traits feed the theme of the Brian Blade Fellowship. 'I want the music to be a fellowship. That's what you want from the world as a whole. I want the music to project that kind of togetherness. This ideal of fellowship is something I grew up with. I just want to extend the good memories.'  ",
      "artwork" : ["brian.jpg"]
    },{
      "index": 4,
      "name": "Steve Gadd",
      "shortname" : "steve",
      "description": " One of the most influential drummers of all time, Steve Gadd set a new standard in contemporary drumming techniques and performance, and in doing so launched a thousand imitators. Recording so many legendary drum tracks like; 'Aja','Fifty Ways to Leave Your Lover' and 'Nite Sprite', there is no drummer alive today who in some way has not been effected by Steve Gadd. His influence is still very much felt and can be heard in the playing of everyone from Vinnie Colaiuta to Carter Beauford. And still to this day there is no one who can get 'inside' a tune and find the 'pocket' quite like the great Steve Gadd.    Steve Gadd was born in Rochester, New York, April 9, 1945.    Steve's Uncle, a drummer in the army, encouraged him to take drum lessons at the age of seven; by the time Steve was 11 he had sat in with Dizzy Gillespie. Studied music at Eastman College, Rochester, playing in wind ensemble and concert band, and at nights in a club with Chick Corea, Chuck Mangione, Joe Romano and Frank Pullara. After college, drafted into army and spent three years in a military band.     After the army he gigged and worked with a big band in Rochester. 1972 he formed a trio with Tony Levin and Mike Holmes, going to New York with it. The trio fizzled out, but Gadd began to work extensively as a studio musician.     He also played with Corea's first Return to Forever. 1970's and 1980's, toured internationally, recorded with Paul Simon and with Al DiMeola's Electric Rendezvous Band.    In 1976 Steve became a member of the group Stuff with Gordon Edwards, Richard Tee, Eric Gale, Cornell Dupree and Chris Parker, while continuing his heavy schedule of studio work. Towards the end of the 70's, Steve had not only become one of the most in-demand drummers, but he had also become one of the most imitated, and revered drummers in the world.    In Japan transcriptions of his solos were on sale, and all the leading Japanese drummers were sounding like him. Chick Corea commented, 'Every drummer wants to play like Gadd because he plays perfect . . . He has brought orchestral and compositional thinking to the drum kit while at the same time having a great imagination and a great ability to swing.'    The 90's saw Steve become Eric Clapton's first call drummer, solidifying Steve's reputation as one of the most accomplished and skilled drummers of his generation.    Today Steve is just as busy as he ever was with one of the most intense recording and touring schedules in the business, spending time in the studio and on the road with Eric Clapton, Paul Simon and James Taylor.    Steve's influence on the drumming community can be heard in players from all walks of life, whether they know it or not. His feel, imagination, and abilities are the signatures of his trademark sound. Few others can manage to get inside a tune like Steve Gadd.   ",
      "artwork" : ["steve.jpg"]
    },{
      "index": 5,
      "name": "Stewart Copeland",
      "shortname" : "stewart",
      "description": " After rising to international stardom with the Police, Stewart Copeland largely rejected his pop music past to pursue a career as a composer, authoring a prolific series of film scores, operas, and ballets.    Born July 16, 1952 in Alexandria, Copeland - the son of a CIA agent - spent his formative years in the Middle East but attended college in California before settling in England in 1975 and playing drums with the progressive rock unit Curved Air.    Following the group's dissolution, he founded the Police with singer/bassist Sting and guitarist Henri Padovani (the latter soon replaced by Andy Summers). Beginning with their first hit, 1979's 'Roxanne,' the trio emerged as one of the most popular and innovative bands of the post-punk era, drawing upon reggae, funk, and world music to create a uniquely infectious yet cerebral brand of pop which generated a series of smash singles including 'Every Little Thing She Does Is Magic,' 'Every Breath You Take,' and 'King of Pain.' While with the Police, Copeland -- who in 1980 issued a solo record, Music Madness from the Kinetic Kid, under the alias Klark Kent -- not only earned wide critical acclaim for his intricate, textured drumwork, but he contributed many of the group's songs as well.    At the peak of their commercial success, the Police disbanded after touring in support of the 1983 blockbuster Synchronicity; by that time Copeland was already established as a film composer, however, earning a Golden Globe nomination for his score to Francis Ford Coppola's Rumble Fish. In 1985 he released The Rhythmatist, the product of his musical pilgrimage to Africa, followed by an ever-increasing number of film scores including a pair of Oliver Stone features, Wall Street and Talk Radio, in addition to acclaimed projects like Ken Loach's Raining Stones, Four Days in September and West Beirut as well as many more mainstream Hollywood productions.    Copeland's other work includes a stint with the pop-fusion trio Animal Logic as well as authoring the San Francisco Ballet's King Lear, the Cleveland Opera's Holy Blood and Crescent Moon, and Ballet Oklahoma's Prey.    Stewart appeared at the Modern Drummer Festival 2006...  ",
      "artwork" : ["stewart.jpg"]
    },{
      "index": 6,
      "name": "Buddy Rich",
      "shortname" : "buddy",
      "description": "Arguably the greatest jazz drummer of all time, the legendary Buddy Rich exhibited his love for music through the dedication of his life to the art. His was a career that spanned seven decades, beginning when Rich was 18 months old and continuing until his death in 1987. Immensely gifted, Rich could play with remarkable speed and dexterity despite the fact that he never received a formal lesson and refused to practice outside of his performances. Born Bernard Rich to vaudevillians Robert and Bess Rich on September 30, 1917, the famed drummer was introduced to audiences at a very young age. By 1921, he was a seasoned solo performer with his vaudeville act, 'Traps the Drum Wonder.' With his natural sense of rhythm, Rich performed regularly on Broadway at the age of four. At the peak of Rich's early career, he was the second-highest paid child entertainer in the world. Rich's jazz career began in 1937 when he began playing with Joe Marsala at New York's Hickory House. By 1939, he had joined Tommy Dorsey's band, and he later went on to play with such jazz greats as Dizzy Gillespie, Charlie Ventura, Louis Armstrong and Gene Krupa. Rich was regularly featured in Jazz at the Philharmonic during the late 40s. He also appeared in such Hollywood films as Symphony of Swing (1939), Ship Ahoy (1942) and How's About It (1943). Throughout the 1960s and 70s, Rich toured with his own bands and opened two nightclubs, Buddy's Place and Buddy's Place II. Both clubs were regularly filled to capacity by fans of the great master drummer. After opening Buddy's Place II, Rich introduced new tunes with elements of rock into his repertoire, demonstrating his ability to adapt to his audience's changing tastes and establishing himself as a great rock drummer. Known for his caustic humor, Rich was a favorite on several television talk shows including the Tonight Show with Johnny Carson, the Mike Douglas Show, the Dick Cavett Show and the Merv Griffin Show. During these appearances, Rich entertained audiences through his constant sparring with the hosts and his slights of various pop singers. This famed musician received outstanding recognition throughout his career. The Downbeat Magazine Hall of Fame Award, the Modern Drummer Magazine Hall of Fame Award and the Jazz Unlimited Immortals of Jazz Award are just a few of his numerous honors. Rich gained international attention for such master compositions as his 10-minute West Side Story medley. During his lengthy career, Rich toured around the globe, performing for millions of fans and several world leaders including the king of Thailand, the queen of England, Franklin Roosevelt, John F. Kennedy, Ronald Regan and King Hussein of Jordan. On April 2, 1987, Rich died of heart failure following surgery for a malignant brain tumor. Long-time friend, Frank Sinatra, presented the eulogy at Rich's funeral. Today, Buddy Rich is remembered as one of history's greatest musicians. According to jazz legend Gene Krupa, Rich was 'The greatest drummer ever to have drawn breath.'",
      "artwork" : ["buddy.jpg"]
    },{
      "index": 7,
      "name": "Mark Guiliana",
      "shortname" : "mark",
      "description": "According to Modern Drummer magazine, Mark Guiliana 'may well be at the forefront of an exciting new style of drumming.' The 28-year-old New Jersey native’s unique and un-compromised approach to playing the drums has earned him international acclaim as both a leader and a sideman. In 2004, Mark created HEERNT, his ‘experimental-garage-jazz’ trio based out of New York. The band’s debut record, Locked In A Basement, was released in the spring of 2006 and was met with praise from critics and musicians alike. Legendary drummer Bill Bruford (Yes, King Crimson) called the record “the most exuberant, dramatic, beautiful, sassy, genre-busting little outing that I've heard since I don't know when.” As a sideman, Mark’s longest partnership has come alongside world-renowned jazz bassist Avishai Cohen. He toured all over the world with Avishai from 2003 until 2008 while appearing on six studio records, and a live DVD recorded at the Blue Note in New York City. Mark has also recorded and/or performed with Meshell Ndegeocello, Dhafer Youssef, Wayne Krantz, Matisyahu, Edmar Castaneda, Jazz Mandolin Project, Jason Lindner, Gretchen Parlato, Brad Shepik, Bobby McFerrin, Tigran Hamasyan, and many more. In 2015 he played drums on the David Bowie album 'Blackstar' together with Donny McCaslin, Ben Monder, Jason Lindner, Tim Lefebvre. Mark plays Yamaha drums, Sabian cymbals, and Vic Firth sticks.",
      "artwork" : ["mark.jpg"]
    },{
      "index": 8,
      "name": "Steve Jordan",
      "shortname" : "jordan",
      "description": "Jordan was a teenager when he first played in Stevie Wonder's band. Later, he played drums for the Saturday Night Live band in the 1970s. When John Belushi and Dan Aykroyd toured as The Blues Brothers in the early 1980s, Jordan was their drummer, and recorded on their resulting album. Jordan, along with fellow Shaffer alumnus Anton Fig, appeared on the Rolling Stones' 1986 release Dirty Work. Steve Jordan is a member of the John Mayer Trio, a blues rock power trio that consists of Jordan, on drums and backing vocals, bassist Pino Palladino and guitarist-singer John Mayer. The group was formed in 2005 by Mayer as a deviation from his pop-acoustic career. The trio released the record Try! on November 22, 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's 'Wait Until Tomorrow' and 'I Got A Woman'. The trio also performed on December 8, 2007, in Los Angeles, California at the L.A. Live Nokia Theatre for the 1st Annual Holiday Charity Revue, which raised funds for various Los Angeles related charities. The DVD/CD release, entitled Where the Light Is: John Mayer Live in Los Angeles features Palladino on bass and Jordan on drums. Jordan would later collaborate with Mayer and Charlie Hunter by writing 'In Repair,' the eleventh track from Mayer's 2006 album Continuum. Jordan also contributed to Mayer's album, 'Battle Studies'. Steve Jordan recorded with such artists as Don Henley, John Mellencamp, Andres Calamaro, Cat Stevens, Bob Dylan, Sonny Rollins, BB King, Stevie Nicks, Sheryl Crow, Neil Young, Jon Spencer Blues Explosion, and many more. He is featured on James Taylor's 1998 DVD, Live at the Beacon Theatre. Jordan has evolved into a Grammy Award-winning and nominated producer with Robert Cray's album Take Your Shoes Off and Buddy Guy's Bring 'Em In, respectively. While he has played on countless records, from Alicia Keys 'If I Ain't Got You' to Bruce Springsteen's Devils and Dust, he continues to produce with such works as the Grammy Award winning John Mayer album Continuum, John Scofield's That's What I Say, Possibilities by Herbie Hancock, and 23rd St. Lullaby with Patti Scialfa. In 2006, Jordan joined Eric Clapton's hand-picked touring band for Clapton's 'European Tour 2006', which included seven sold out shows at the Royal Albert Hall. He continued in Clapton's band as they toured North America in 2007. In 2008, Jordan produced and played percussion on one track for Los Lonely Boys' third album, Forgiven, at East Side Stages in Austin, Texas. In 2009, Jordan received another Grammy Award nomination - the Grammy Award for Best Compilation Soundtrack Album for a Motion Picture, Television or Other Visual Media, for his work on the soundtrack scoring film for the movie Cadillac Records. Jordan formed a band with his wife, Meegan Voss, and they have toured and recorded under the band name The Verbs. The music has been described as 'The perfect cocktail of girl group, Brit-pop, country, ska and Rock and Roll.' They toured Japan in 2006 in support of their first release, And Now... The Verbs. As in their previous release, this album features Tamio Okuda on lead guitars, Pino Palladino on bass and additional classic guitar work by Danny 'Kootch' Kortchmar.",
      "artwork" : ["jordan.jpg"]
    },{
      "index": 9,
      "name": "Nate Smith",
      "shortname" : "nate",
      "description": "Born in Norfolk, Virginia, Nate's musical journey began at age eleven when, after watching his older brother play for years, he decided to seriously take up the drums. His earliest influences were rock and funk music, a diverse pool of artists like the Police, Earth, Wind and Fire, and Quincy Jones. The true breakthrough however, came when he heard the legendary Art Blakey and the Jazz Messengers Album of The Year at the age of sixteen. After graduating high school in 1992, Nate decided to pursue his musical studies at James Madison University. In his third year, Nate's small group was chosen to play at the International Associiation of Jazz Educators conference in Atlanta, Georgia. It was there that he met the legendary jazz singer Betty Carter and was invited to be a part of her esteemed Jazz Ahead program which has produced a who's who of jazz alumni that includes among others: Cyrus Chestnut, Jason Moran, Gregory Hutchinson, Andre Hayward and Jacky Terrason. Later that year, at the age of 20, Nate was on stage with Betty at the Blue Note club in New YorkCity. He was also featured with Carter on BET's 'Jazz Central' and CBS 'Sunday Morning'. After college, Nate was offered a scholarship to pursue graduate studies as a part of Virginia Commonwealth University's 'Carpenter Fellowship' program. It was there that he met legendary jazz bassist and composer Dave Holland. Over the next few years he occasionally performed with Dave, finally joining his quintet in September of 2003. In addition to being a fine drummer, Nate is an accomplished composer, songwriter and producer. He has composed scores for several broadcast documentaries for both 'The Discovery Channel' and 'The Learning Channel' and has worked with such R&B and smooth jazz artists as Marcus Johnson, Moifah, Jareed Arosmana and Alyson Williams among many others. Nate's work can also be heard on the song 'Heaven Can Wait' on the Michael Jackson CD 'Invincible'. He has recently formed a production company, Water Baby Music, Inc.",
      "artwork" : ["nate.jpg"]
    }]
  }
