
{
    "drummers": [{
      "index": 0,
      "name": "John Bonham",
      "shortname" : "bonham",
      "description": " John Bonham is the most influential Rock Drummer of all-time.   Describing the style of John Bonham's drumming instantly conjurs up visions of the thunderous power he created. His contributions to rock music were revolutionary, and his talent unmatched and irreplaceable. You can only imagine Jimmy Page's reaction to first seeing him in 1968, ending his search for a new drummer to form a new band, the New Yardbirds (later renamed Led Zeppelin.)    A childhood friend of Robert Plant, they played together in the 'Band of Joy', resulting in local gigs and a few studio demos. At first, Bonham was reluctant to join the well-known guitarist because of a steady gig with Tim Rose. But... the rest of history...    As John Paul Jones, Jimmy Page and Robert Plant have all stated many times, Led Zeppelin wouldn't have been half as good without him. Along with JPJ, they provided the solid foundation and backbone of the band, which made it all possible. Live performances truly showcased his abilities during the numerous improvised jams throughout every concert and of course his famous 'Moby Dick' drum solo; reaching a half-hour in length at times! Immitators are usually left frustrated, since Bonham made it look so easy - not only in his playing but also in the incredible drum sound he acheived. His legendary right foot (on his bass pedal) and lightning-fast triplets were his instant trademark. He later refined his style from the hard skin-bashing approach to a more delicate wrist controlled one - which produced an even more powerful & louder sound with less effort.    His tragic passing on September 25th, 1980 immortalized his legacy forever. His only son, Jason proudly continues the tradition.  ",
      "artwork": ["john_bonham.jpg"]
    },{
      "index": 1,
      "name": "Vinnie Colaiuta",
      "shortname" : "vinnie",
      "description": " Vincent Colaiuta is a highly regarded drummer based in Los Angeles. Originally from Brownsville, Pennsylvania, he began playing drums as a child and received his first full drum kit from his parents at the age of 14.    After attending the Berklee College of Music in Boston for a year, Colaiuta relocated to Los Angeles and made a mediocre living playing with lounge bands. His break came in April 1978 at the age of 22, when he auditioned for Frank Zappa, an audition that involved performing the notoriously difficult piece entitled ìThe Black Pageî. The audition was successful and Colaiuta went on to work with Zappa as his principal drummer for studio and live performances.    Colaiuta's performances on Zappa's albums Tinsel Town Rebellion, Joe's Garage and Shut Up 'n Play Yer Guitar are considered by many drummers to be among the most astounding ever recorded. Joe's Garage was named one of the top-25 drumming performances of all time in a 1993 Modern Drummer article.    After leaving Zappa, Colaiuta went on to work with a long list of notable rock and pop artists, including Gino Vannelli, Joni Mitchell, Barbra Streisand, Sandy & Junior, Clannad, Wang Chung, Chaka Khan, and Jeff Beck. He has also appeared with many notable jazz musicians, including Chick Corea, Herbie Hancock, Jimmy Haslip, Quincy Jones, the Buddy Rich Big Band and Buell Neidlinger.    In 1990, Colaiuta successfully auditioned for the drum spot in Sting's touring band in support of his album The Soul Cages. Colaiuta remained as a member of Sting's band for the next seven years. He declined the offer to go out on the road for the Brand New Day tour in 1999 due to the unusually grueling amount of time that Sting prefers to cover the globe.   Colaiuta's studio work with Sting can be heard on Ten Summoner's Tales (1993), Mercury Falling (1996), three songs on Brand New Day (1999) and two songs on Sacred Love (2003). In September of 2003, Vinnie returned to Sting's touring lineup in a brief promotional tour of Sacred Love, but once again declined the offer to participate in the world tour.   Colaiuta released a self-titled solo recording in 1994, and still remains one of the most in demand studio musicians playing on countless albums, film soundtracks, TV and radio jingles.    In 2006-07, Colaiuta toured with ﻿Jeff Beck and ﻿Tal Wilkenfeld on bass, with ﻿Jason Rebello playing keyboards, in ﻿Eric Clapton's ﻿Crossroads Guitar Festival. He has recorded and performed with artists as diverse as ﻿country artist ﻿Faith Hill, whom he toured with and played on the albums ﻿Cry and ﻿Fireflies, ﻿thrash metal outfit ﻿Megadeth on their album ﻿The System Has Failed and jazz musician ﻿Herbie Hancock.    Vinnie played Yamaha Drums for more than 10 years during the 80's. Then in the early 90's, he switched to Gretsch Drums. In 2012 he switched to Ludwig Drums, and then to Heuer Drums in 2014. On June 2016 Vinnie is returning to play Gretsch drums again....  ",
      "artwork" : ["vinnie.jpg"]
    },{
      "index": 2,
      "name": "Carter Beauford",
      "shortname" : "carter",
      "description": " Carter Beauford grew up in a household full of music. Everything from jazz, gospel to the Beatles was played.    For Carter Beauford, it all started when he was three years old. His father was going to a Buddy Rich concert, but he couldn't find a babysitter for young Carter. His only solution was to take Carter with him. From the moment Carter laid eyes and ears upon Buddy Rich, he was enthralled and facinated with Rich.    After the concert, the young Carter took up drums and wanted to emulate Buddy Rich. I guess you could call Buddy Rich Carter's idol when he was a young lad. Upon hearing his son's playing, Carter's father was impressed and bought him a Roy Rogers drum kit made with paper heads and tin shells. This was all Carter needed. So thank Carter's father for bringing this wonderful drummer into the world!    During those young years, Carter's major influences were Tony Williams, Papa Jo Jones, and of course, Buddy Rich.    Throughtout his career, Carter has played with many different bands with various musical styles. Carter feels it is important to have an open mind musically and to expose oneself to different forms of music.    One band, besides the Dave Matthews Band, that Carter is very proud of was called, Secrets. This band played the Richmond, Virginia area and was composed of many talented musicians, including Carter on the drums. After this band dissolved, Carter went to California to try out for the Arsenio Hall show. For whatever reason, the Show didn't want Carter, so he moved back to Virginia; which is where the next chapter of his life starts.  ",
      "artwork" : ["carter.jpg"]
    },{
      "index": 3,
      "name": "Brian Blade",
      "shortname" : "brian",
      "description": " Louisiana-born, Brian Blade grew up in Shreveport, then New Orleans, where he distilled the unique drumming styles and musical heritage of the nation's spiritual underbelly into a powerfully swinging percussive trademark. Nurtured under the watchful eyes of Ellis Marsalis and New Orleans Dixie-drum masters Johnny Vidacovich and Herlin Riley, Blade learned to find his 'knit in the blanket' of sounds and styles.    From albums and tours with Joshua Redman and Kenny Garrett, to recent recordings with Bob Dylan (Time Out Of Mind), Emmylou Harris (Wrecking Ball), Daniel Lanois (Sling Blade) and hero Joni Mitchell, Brian has shown deep musical instincts and a phenomenal gift for playing music texturally -- both thick and thin -- on the drums. His evolution continues on his astounding, highly acclaimed Blue Note debut, Brian Blade Fellowship. The line-up of Fellowship, Brian's band, is as potent as its leader's musical skills: Jon Cowherd, piano and Wurlitzer, Christopher Thomas on bass, Melvin Butler, tenor and soprano sax, Myron Walden, alto sax, Jeff Parker, guitar; and Dave Easley, pedal steel guitar. This self-titled album was produced by Daniel Lanois who also guested on the album playing mando-guitar and Fender Mustang guitar; Mark Howard recorded and mixed at The Teatro in Oxnard, California.    Brian Blade makes music that exists beyond borders. Spirituality, sensitivity, honesty, loyalty, all these traits feed the theme of the Brian Blade Fellowship. 'I want the music to be a fellowship. That's what you want from the world as a whole. I want the music to project that kind of togetherness. This ideal of fellowship is something I grew up with. I just want to extend the good memories.'  ",
      "artwork" : ["brian.jpg"]
    },{
      "index": 4,
      "name": "Steve Gadd",
      "shortname" : "steve",
      "description": " One of the most influential drummers of all time, Steve Gadd set a new standard in contemporary drumming techniques and performance, and in doing so launched a thousand imitators. Recording so many legendary drum tracks like; 'Aja','Fifty Ways to Leave Your Lover' and 'Nite Sprite', there is no drummer alive today who in some way has not been effected by Steve Gadd. His influence is still very much felt and can be heard in the playing of everyone from Vinnie Colaiuta to Carter Beauford. And still to this day there is no one who can get 'inside' a tune and find the 'pocket' quite like the great Steve Gadd.    Steve Gadd was born in Rochester, New York, April 9, 1945.    Steve's Uncle, a drummer in the army, encouraged him to take drum lessons at the age of seven; by the time Steve was 11 he had sat in with Dizzy Gillespie. Studied music at Eastman College, Rochester, playing in wind ensemble and concert band, and at nights in a club with Chick Corea, Chuck Mangione, Joe Romano and Frank Pullara. After college, drafted into army and spent three years in a military band.     After the army he gigged and worked with a big band in Rochester. 1972 he formed a trio with Tony Levin and Mike Holmes, going to New York with it. The trio fizzled out, but Gadd began to work extensively as a studio musician.     He also played with Corea's first Return to Forever. 1970's and 1980's, toured internationally, recorded with Paul Simon and with Al DiMeola's Electric Rendezvous Band.    In 1976 Steve became a member of the group Stuff with Gordon Edwards, Richard Tee, Eric Gale, Cornell Dupree and Chris Parker, while continuing his heavy schedule of studio work. Towards the end of the 70's, Steve had not only become one of the most in-demand drummers, but he had also become one of the most imitated, and revered drummers in the world.    In Japan transcriptions of his solos were on sale, and all the leading Japanese drummers were sounding like him. Chick Corea commented, 'Every drummer wants to play like Gadd because he plays perfect . . . He has brought orchestral and compositional thinking to the drum kit while at the same time having a great imagination and a great ability to swing.'    The 90's saw Steve become Eric Clapton's first call drummer, solidifying Steve's reputation as one of the most accomplished and skilled drummers of his generation.    Today Steve is just as busy as he ever was with one of the most intense recording and touring schedules in the business, spending time in the studio and on the road with Eric Clapton, Paul Simon and James Taylor.    Steve's influence on the drumming community can be heard in players from all walks of life, whether they know it or not. His feel, imagination, and abilities are the signatures of his trademark sound. Few others can manage to get inside a tune like Steve Gadd.   ",
      "artwork" : ["steve.jpg"]
    },{
      "index": 5,
      "name": "Stewart Copeland",
      "shortname" : "stewart",
      "description": " After rising to international stardom with the Police, Stewart Copeland largely rejected his pop music past to pursue a career as a composer, authoring a prolific series of film scores, operas, and ballets.    Born July 16, 1952 in Alexandria, Copeland - the son of a CIA agent - spent his formative years in the Middle East but attended college in California before settling in England in 1975 and playing drums with the progressive rock unit Curved Air.    Following the group's dissolution, he founded the Police with singer/bassist Sting and guitarist Henri Padovani (the latter soon replaced by Andy Summers). Beginning with their first hit, 1979's 'Roxanne,' the trio emerged as one of the most popular and innovative bands of the post-punk era, drawing upon reggae, funk, and world music to create a uniquely infectious yet cerebral brand of pop which generated a series of smash singles including 'Every Little Thing She Does Is Magic,' 'Every Breath You Take,' and 'King of Pain.' While with the Police, Copeland -- who in 1980 issued a solo record, Music Madness from the Kinetic Kid, under the alias Klark Kent -- not only earned wide critical acclaim for his intricate, textured drumwork, but he contributed many of the group's songs as well.    At the peak of their commercial success, the Police disbanded after touring in support of the 1983 blockbuster Synchronicity; by that time Copeland was already established as a film composer, however, earning a Golden Globe nomination for his score to Francis Ford Coppola's Rumble Fish. In 1985 he released The Rhythmatist, the product of his musical pilgrimage to Africa, followed by an ever-increasing number of film scores including a pair of Oliver Stone features, Wall Street and Talk Radio, in addition to acclaimed projects like Ken Loach's Raining Stones, Four Days in September and West Beirut as well as many more mainstream Hollywood productions.    Copeland's other work includes a stint with the pop-fusion trio Animal Logic as well as authoring the San Francisco Ballet's King Lear, the Cleveland Opera's Holy Blood and Crescent Moon, and Ballet Oklahoma's Prey.    Stewart appeared at the Modern Drummer Festival 2006...  ",
      "artwork" : ["stewart.jpg"]
    },{
      "index": 6,
      "name": "Buddy Rich",
      "shortname" : "buddy",
      "description": "Arguably the greatest jazz drummer of all time, the legendary Buddy Rich exhibited his love for music through the dedication of his life to the art. His was a career that spanned seven decades, beginning when Rich was 18 months old and continuing until his death in 1987. Immensely gifted, Rich could play with remarkable speed and dexterity despite the fact that he never received a formal lesson and refused to practice outside of his performances. Born Bernard Rich to vaudevillians Robert and Bess Rich on September 30, 1917, the famed drummer was introduced to audiences at a very young age. By 1921, he was a seasoned solo performer with his vaudeville act, 'Traps the Drum Wonder.' With his natural sense of rhythm, Rich performed regularly on Broadway at the age of four. At the peak of Rich's early career, he was the second-highest paid child entertainer in the world. Rich's jazz career began in 1937 when he began playing with Joe Marsala at New York's Hickory House. By 1939, he had joined Tommy Dorsey's band, and he later went on to play with such jazz greats as Dizzy Gillespie, Charlie Ventura, Louis Armstrong and Gene Krupa. Rich was regularly featured in Jazz at the Philharmonic during the late 40s. He also appeared in such Hollywood films as Symphony of Swing (1939), Ship Ahoy (1942) and How's About It (1943). Throughout the 1960s and 70s, Rich toured with his own bands and opened two nightclubs, Buddy's Place and Buddy's Place II. Both clubs were regularly filled to capacity by fans of the great master drummer. After opening Buddy's Place II, Rich introduced new tunes with elements of rock into his repertoire, demonstrating his ability to adapt to his audience's changing tastes and establishing himself as a great rock drummer. Known for his caustic humor, Rich was a favorite on several television talk shows including the Tonight Show with Johnny Carson, the Mike Douglas Show, the Dick Cavett Show and the Merv Griffin Show. During these appearances, Rich entertained audiences through his constant sparring with the hosts and his slights of various pop singers. This famed musician received outstanding recognition throughout his career. The Downbeat Magazine Hall of Fame Award, the Modern Drummer Magazine Hall of Fame Award and the Jazz Unlimited Immortals of Jazz Award are just a few of his numerous honors. Rich gained international attention for such master compositions as his 10-minute West Side Story medley. During his lengthy career, Rich toured around the globe, performing for millions of fans and several world leaders including the king of Thailand, the queen of England, Franklin Roosevelt, John F. Kennedy, Ronald Regan and King Hussein of Jordan. On April 2, 1987, Rich died of heart failure following surgery for a malignant brain tumor. Long-time friend, Frank Sinatra, presented the eulogy at Rich's funeral. Today, Buddy Rich is remembered as one of history's greatest musicians. According to jazz legend Gene Krupa, Rich was 'The greatest drummer ever to have drawn breath.'",
      "artwork" : ["buddy.jpg"]
    },{
      "index": 7,
      "name": "Mark Guiliana",
      "shortname" : "mark",
      "description": "According to Modern Drummer magazine, Mark Guiliana 'may well be at the forefront of an exciting new style of drumming.' The 28-year-old New Jersey native’s unique and un-compromised approach to playing the drums has earned him international acclaim as both a leader and a sideman. In 2004, Mark created HEERNT, his ‘experimental-garage-jazz’ trio based out of New York. The band’s debut record, Locked In A Basement, was released in the spring of 2006 and was met with praise from critics and musicians alike. Legendary drummer Bill Bruford (Yes, King Crimson) called the record “the most exuberant, dramatic, beautiful, sassy, genre-busting little outing that I've heard since I don't know when.” As a sideman, Mark’s longest partnership has come alongside world-renowned jazz bassist Avishai Cohen. He toured all over the world with Avishai from 2003 until 2008 while appearing on six studio records, and a live DVD recorded at the Blue Note in New York City. Mark has also recorded and/or performed with Meshell Ndegeocello, Dhafer Youssef, Wayne Krantz, Matisyahu, Edmar Castaneda, Jazz Mandolin Project, Jason Lindner, Gretchen Parlato, Brad Shepik, Bobby McFerrin, Tigran Hamasyan, and many more. In 2015 he played drums on the David Bowie album 'Blackstar' together with Donny McCaslin, Ben Monder, Jason Lindner, Tim Lefebvre. Mark plays Yamaha drums, Sabian cymbals, and Vic Firth sticks.",
      "artwork" : ["mark.jpg"]
    },{
      "index": 8,
      "name": "Steve Jordan",
      "shortname" : "jordan",
      "description": "Jordan was a teenager when he first played in Stevie Wonder's band. Later, he played drums for the Saturday Night Live band in the 1970s. When John Belushi and Dan Aykroyd toured as The Blues Brothers in the early 1980s, Jordan was their drummer, and recorded on their resulting album. Jordan, along with fellow Shaffer alumnus Anton Fig, appeared on the Rolling Stones' 1986 release Dirty Work. Steve Jordan is a member of the John Mayer Trio, a blues rock power trio that consists of Jordan, on drums and backing vocals, bassist Pino Palladino and guitarist-singer John Mayer. The group was formed in 2005 by Mayer as a deviation from his pop-acoustic career. The trio released the record Try! on November 22, 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's 'Wait Until Tomorrow' and 'I Got A Woman'. The trio also performed on December 8, 2007, in Los Angeles, California at the L.A. Live Nokia Theatre for the 1st Annual Holiday Charity Revue, which raised funds for various Los Angeles related charities. The DVD/CD release, entitled Where the Light Is: John Mayer Live in Los Angeles features Palladino on bass and Jordan on drums. Jordan would later collaborate with Mayer and Charlie Hunter by writing 'In Repair,' the eleventh track from Mayer's 2006 album Continuum. Jordan also contributed to Mayer's album, 'Battle Studies'. Steve Jordan recorded with such artists as Don Henley, John Mellencamp, Andres Calamaro, Cat Stevens, Bob Dylan, Sonny Rollins, BB King, Stevie Nicks, Sheryl Crow, Neil Young, Jon Spencer Blues Explosion, and many more. He is featured on James Taylor's 1998 DVD, Live at the Beacon Theatre. Jordan has evolved into a Grammy Award-winning and nominated producer with Robert Cray's album Take Your Shoes Off and Buddy Guy's Bring 'Em In, respectively. While he has played on countless records, from Alicia Keys 'If I Ain't Got You' to Bruce Springsteen's Devils and Dust, he continues to produce with such works as the Grammy Award winning John Mayer album Continuum, John Scofield's That's What I Say, Possibilities by Herbie Hancock, and 23rd St. Lullaby with Patti Scialfa. In 2006, Jordan joined Eric Clapton's hand-picked touring band for Clapton's 'European Tour 2006', which included seven sold out shows at the Royal Albert Hall. He continued in Clapton's band as they toured North America in 2007. In 2008, Jordan produced and played percussion on one track for Los Lonely Boys' third album, Forgiven, at East Side Stages in Austin, Texas. In 2009, Jordan received another Grammy Award nomination - the Grammy Award for Best Compilation Soundtrack Album for a Motion Picture, Television or Other Visual Media, for his work on the soundtrack scoring film for the movie Cadillac Records. Jordan formed a band with his wife, Meegan Voss, and they have toured and recorded under the band name The Verbs. The music has been described as 'The perfect cocktail of girl group, Brit-pop, country, ska and Rock and Roll.' They toured Japan in 2006 in support of their first release, And Now... The Verbs. As in their previous release, this album features Tamio Okuda on lead guitars, Pino Palladino on bass and additional classic guitar work by Danny 'Kootch' Kortchmar.",
      "artwork" : ["jordan.jpg"]
    },{
      "index": 9,
      "name": "Nate Smith",
      "shortname" : "nate",
      "description": "Born in Norfolk, Virginia, Nate's musical journey began at age eleven when, after watching his older brother play for years, he decided to seriously take up the drums. His earliest influences were rock and funk music, a diverse pool of artists like the Police, Earth, Wind and Fire, and Quincy Jones. The true breakthrough however, came when he heard the legendary Art Blakey and the Jazz Messengers Album of The Year at the age of sixteen. After graduating high school in 1992, Nate decided to pursue his musical studies at James Madison University. In his third year, Nate's small group was chosen to play at the International Associiation of Jazz Educators conference in Atlanta, Georgia. It was there that he met the legendary jazz singer Betty Carter and was invited to be a part of her esteemed Jazz Ahead program which has produced a who's who of jazz alumni that includes among others: Cyrus Chestnut, Jason Moran, Gregory Hutchinson, Andre Hayward and Jacky Terrason. Later that year, at the age of 20, Nate was on stage with Betty at the Blue Note club in New YorkCity. He was also featured with Carter on BET's 'Jazz Central' and CBS 'Sunday Morning'. After college, Nate was offered a scholarship to pursue graduate studies as a part of Virginia Commonwealth University's 'Carpenter Fellowship' program. It was there that he met legendary jazz bassist and composer Dave Holland. Over the next few years he occasionally performed with Dave, finally joining his quintet in September of 2003. In addition to being a fine drummer, Nate is an accomplished composer, songwriter and producer. He has composed scores for several broadcast documentaries for both 'The Discovery Channel' and 'The Learning Channel' and has worked with such R&B and smooth jazz artists as Marcus Johnson, Moifah, Jareed Arosmana and Alyson Williams among many others. Nate's work can also be heard on the song 'Heaven Can Wait' on the Michael Jackson CD 'Invincible'. He has recently formed a production company, Water Baby Music, Inc.",
      "artwork" : ["nate.jpg"]
    },{
      "index": 10,
      "name": "Jojo Mayer",
      "shortname" : "jojo",
      "description": "Born January 18. 1963 in Zurich, Switzerland. Son of a musician (bass player Vali Mayer), he spent his early childhood on the road traveling throughout Europe and the Far East. At the age of 2 he got his first drum set, and his first public performance took place in Hong Kong when he was only 3 years old. Growing up in the influence of a musical environment Jojo is basically self-taught (autodidact). At the age of 18 he joined Monty Alexander's group and toured extensively all over Europe, playing all the major jazz -festivals including the North-Sea-Jazz Festival, Montreux, Nice, Antibes, Athens etc.This lead to back-up gigs with other jazz-greats such as Dizzy Gillespie and Nina Simone and introduced him to an international audience. Jojo Mayer performed and / or recorded with a great variety of artists covering a wide range of musical styles such as The Screaming Headless Torsos, Meshell n'dege Occello, Vernon Reid's science project, DJ Spooky, Emergency Broadcast Network, the Vienna Art Orchestra, Wolfgang Muthspiel, Harry Pepl, Gerald Veasley, Monty Alexander, Lunar Crush, John Zorn, James Blood Ulmer, Chico Freeman, George Adams, Jamaaladeen Tacuma, John Medeski, Family of Percussion, Hiram Bullock, Leni Stern, Depart, Wolfgang Puschnigg, The intergalactic Maiden Ballet, Friedrich Gulda, Harry Sokal, Steve Coleman's 5 Elements, Passport, Wah Wah Watson, and many more. Jojo has also built himself a reputation as a skilled and creative solo performer/ clinician. He appeared at most of the important Industrial Events and Drum Festivals like the Modern Drummer Festival (1998 and 2005), the Buddy Rich Memorial Scholarship NYC (95), the International Drummer-Meeting in Koblenz (89, 91, 95), PASIC (96), the Montreal Drum- Fest (96), the NAMM-Show`s 'Drums along the Hilton'(96), int.Slagwerkkrant Dag (96), int. Budapest Dob-Gala (94, 95), Manny`s Drum-Mania NYC (98) and the 'int.Musik Messe Frankfurt'(93, 97), to name a view, were he was featured amongst the greatest names in the drumming community today. Residing in New York City since 1991, Jojo engaged in numerous activities including Live and Studio work. His international touring schedule has taken him all over Europe, the US, South America, The Far East and Africa. Besides his work as a drummer, he also is involved in projects as a writer and producer. More recently, Jojo has been venturing into New York's Techno / Multimedia / Avantgarde / club scene by promoting his own weekly party event called PROHIBITED BEATZ. This new platform for live 'Drum n' Bass', 'Nu-Skool Breaks', 'Speed Garage' and the latest stylistical hybrids and mutations in DJ culture, has also provided the back drop for his first solo project called NERVE. Described as an 'endeavor in reverse engineering the textures and rhythms of the current stream of computer generated music into a live performed, improvisational format', NERVE and PROHIBITED BEATZ have created a reputation in the New York scene that already goes way beyond 'a serious buzz'. Performances and recordings have earned him rave reviews: Jojo Mayer '...destined for 'Drum God' status !'(Modern Drummer magazine). Jojo Mayer's company endorsements include: Sonor drums, Sabian cymbals, Remo drumheads and Vic Firth drumsticks. Lately he has been involved as a product developer / designer for Sabian (Jojo Mayer Signature 'Fierce Ride' & 'Fierce Crash' Models), a consultant for Sonor's 'Jungle Kit' and as a designer for Vic Firth drumsticks (Jojo Mayer Signature Model). He has also frequently appeared in advertisements, catalogues and publications for the above mentioned companies.",
      "artwork" : ["jojo.jpg"]
    },{
      "index": 11,
      "name": "Elvin Jones",
      "shortname" : "elvin",
      "description": "Elvin Jones is one of the most important drummers in history of Modern Jazz. Elvin Ray Jones was born September 9, 1927 in Pontiac, Michigan, the youngest of ten children. His father, originally from Vicksburg, Mississipi, was a lumber inspector for General Motors, a deacon in the Baptist church, and a bass in the church choir. 'The greatest lady in the world', as Elvin describes his mother, encouraged him and above all taught him the value of self-sufficiency; the strenght to survive that 'was especially valuable to me in the beginning as a musician'. Music was in full flower in the Jones home. Brother Hank is known as one of the finest pianists in jazz, and brother Thad became a highly successful trumpet and flugelhorn player, arranger and band leader. By age 13, determined to be a drummer, Elvin was practicing eight to ten hours a day. He went nowhere without drum sticks in his pocket, and would beat out rhythms on any available surface. Early influences Elvin likes to cite range from Kenny Clarke, Max Roach and Jo Jones to parade drummers and the American Legion Drum Corps! In 1946 Elvin enlisted in the Army, and toured with a Special Services show called Operation Happiness - as a stagehand. Unofficially, however, he was honing his own musical skills and gaining confidence, playing at post social affairs. Jones was discharged in 1949, returning to a Detroit musical scene that was as vibrant as any outside New York. His first professional job was at Grand River Street, where things went well until the leader absconded with the receipts on Christmas Eve, Elvin began to frequent the Bluebird Inn, where he was sometimes asked to sit in. He always refused, thinking 'it was presumptuous to sit in with these musicians, because... they were the greatest people I knew.' In time, Jeader Billy Mitchell hired Elvin, and in three years at the club he backed up visiting stars including the legendary Charlie Parker, Sonny Stitt, Wardell Grey, and, for six months, Miles Davis. In Addition, Monday nights there were jam sessions Elvin organized at his home, Tuesdays a concert series near a local university, and Elvin and his brother Thad promoted Sunday festival-style concerts. The long list of musicians Elvin played with during this period includes Miles Davis, Sonny Stitt, Tommy Flanagan, Pepper Adams, Barry Harris, Kenny Burrell, Milt Jackson, Lou Hayes and Yusef Lateef. Elvin made his move to New York ostensibly to audition for a new Benny Goodman band. Instead, he ended up with Charles Mingus, and in subsequent years he developed his style with Bud Powell, Miles Davis, the Pepper Adams-Donald Byrd Quintet, Art Farmer and J.J. Johnson. He also had his first experiences playing with Miles' tenor man and the increasingly celebrated recording artist John Coltrane. After leaving Miles in 1960, Coltrane was touring in San Francisco with his new group when he flew back to New York to seek out Elvin. Elvin joined one of jazz' most celebrated alliances in, of all places, Denver, Colorado. Through 1966, Elvin contributed to some of the most controversial, influential, and ultimately important music in jazz. Among the triumphant recordings from his great association are 'A love Supreme' and 'Coltrane 'Live' at the Village Vanguard'. About this experience, Elvin comments: 'Right from the beginning to the last time we played together it was something pure. The most impressive thing was a feeling of steady, collective learning... If there is anything like perfect harmony in human relationships, that band was as close as you can come'. In March 1966, Elvin left Coltrane. After a brief European tour with Duke Ellington's band he returned to New York to begin his distinguished career as leader, with a series of innovative piano-less trios featuring Joe Farrell on tenor alto and flute, and one of several bassists including Jimmy Garrison, Bill Wood, Charlie Haden and Wilbur Little. Also in 1966 Elvin married Keiko, whom he met in Nagasaki, Japan. Keiko has become Elvin's partner in every sense: besides providing inspiration, she is also his personal and business manager. Keiko is involved creatively as composer and arranger; Elvin has performed and recorded many of her works, including 'Mr. Jones', 'Shinjitsu' and 'Zange'. Elvin has been heard on nearly 500 recordings, with no end in sight. He also made a temporary detour to Hollywood in 1971 to appear as the character Job Cain in the ABC Paramount film 'Zachariah'. Reflecting his deep commitment to the music ('Playing is not something I do at night' he said, 'It's my function in life').",
      "artwork" : ["elvin.jpg"]
    },{
      "index": 12,
      "name": "Aaron Spears",
      "shortname" : "aaron",
      "description": "Aaron was born October 26, 1976. As he grew, so did his passion for the drums and love for music. His parents raised him in a Pentecostal church in DC. That's where he got his first taste of playing with a band. He would sit on the first pew of the church closest to the drums, with his sticks in hand, feigning for his turn to play. Aaron would finally get his turn at the age of 23, when he hooked up with a local band in DC called Gideon Band (GB). Their music is best described as a fusion of jazz, R&B and rock, serving as the foundation for lyrics spreading God's word. It was with GB that Aaron began to really express himself as a musician and gained the attention of people not only in his local area but also all over the country. It was his work with them and the great timing of one of his mentors, Gerald Heyward, which helped him to gain the audience of Usher's MD Valdez Brantley. Joining Usher's camp has not only awarded Aaron the opportunity to play with some of the greatest musicians on the planet in the form of Juan 'Natural' Najera, Arthur Strong, Valdez Brantley, but also worked with them to produce 2 tracks on Usher's multi-platinum CD 'Confessions.' Aaron later continued with the 'Funk Rock Orchestra' (Usher's Band) as they toured all over the world for the next year and a half. It was on this tour that Aaron began to gain some major attention and found his name in the same sentences with some of his heroes and greatest influences. Aaron attributes his success first to God. Aaron also recognizes a host of great players through the years who he has looked to as inspiration. Michael Williams, Joel Smith, Jeff Davis, Kevin Brunson, Gerald Heyward, Teddy Campbell, Dennis Chambers, Steve Smith, Vinnie Colaiuta, Simon Phillips, Billy Cobham, Dave Weckl, Chris Dave, Michael Bland, Carter Beauford, Papa Jo Jones, Travis Barker, Stewart Copeland, Paul 'Buggy' Edwards, Milton Smith, Steve Gadd, Calvin Rogers, Little John Roberts, Adrian Young, Brian Frasier-Moore, and Nissan Stuart are some of the musicians that have helped to influence and inspire Aaron.",
      "artwork" : ["aaron.jpg"]
    },{
      "index": 13,
      "name": "Dave Weckl",
      "shortname" : "weckl",
      "description": "  For more than 25 years, Dave Weckl has developed and maintained a reputation as one of the great living drummers. For this, he has received numerous accolades and honors. Born in St. Louis Missouri, January 8th, 1960, Dave started playing drums around the age of 8. During his high school years, Dave received many awards from the NAJE (National Association of Jazz Educators) for outstanding performances in his high school's competition-winning jazz band. He was involved with numerous local groups from a very young age while studying with St. Louis-area teachers Bob Matheny and Joe Buerger. At age 16, Dave began to work professionally with local pop and jazz groups. In 1979, he moved to the East coast to study music at the University of Bridgeport in Connecticut. While playing the club scene in New York City with a band called Nite Sprite, Dave started to receive accolades from established studio musicians such as Steve Kahn, Michael Brecker, and especially drumming great Peter Erskine. It was Peter who recommended Dave for his first 'big gig' in town with a group called French Toast, forerunner to the Michel Camilo band. From this group, legendary bassist Anthony Jackson recommended Dave for the prestigious Simon and Garfunkel reunion tour in 1983. After this tour, Dave was regularly being called for radio and TV jingles, sound track sessions, and top recording dates with such artists as George Benson, Peabo Bryson, Diana Ross, and Robert Plant. In 1985, Michael Brecker suggested to Chick Corea that he look into Dave's services for his new Elektric Band. That was the beginning of a seven year relationship with both the Elektric and Akoustic Bands, where nine recordings and three videos were produced, including a Grammy for the first Akoustic Band release. As a solo artist, Dave has recorded and produced nine recordings to date, including GRP/MCA solo releases Masterplan, Heads Up, and Hardwired. In 1998, Dave realized his long-time goal of forming a world-touring band. The Dave Weckl Band released five studio records, including: Rhythm Of The Soul, Synergy, Transition, Perpetual Motion, and Multiplicity. The band also released a hot live album, LIVE (and very plugged in) and a compilation of DWB and instructional videos entitled The Zone. More recently, Dave has enjoyed taking on more sideman work. He regularly joins guitarist Mike Stern, Chuck Loeb, Oz Noy, and Chris Minh Doky and the Nomads, among others. When off the road, Dave keeps busy with session and production work at his home studio in Los Angeles. He also teaches at the annual Drum Fantasy Camp. Additionally, Dave has many instructional video/DVDs and play-along packages on the market. Of course, a guy this busy does need to get around town efficiently. A fan of automobiles, Dave stays on schedule by driving a 505 horsepower Corvette Z06.",
      "artwork" : ["weckl.jpg"]
    },{
      "index": 14,
      "name": "Antonio Sanchez",
      "shortname" : "antonio",
      "description": "Four time Grammy Award winner Antonio Sanchez is considered by many critics and musicians alike as one of the most prominent drummers, bandleaders and composers of his generation. Born in Mexico City on November 1st, 1971, he started playing drums at the age of 5 and began performing professionally early in his teens. Antonio pursued a degree in classical piano at the National Conservatory in Mexico and in 1993 he moved to Boston to enroll at Berklee College of Music and New England Conservatory. He graduated Magna Cum Laude in Jazz Studies. Since his move to New York City in 1999 Antonio has become one of the most sought after drummers in the international jazz scene. His playing is featured in over a hundred albums and has performed and recorded with some of the biggest names in jazz including Chick Corea, Michael Brecker, Charlie Haden, Gary Burton and Toots Thielmans. He has been the drummer of choice for 20 time Grammy winner Pat Metheny and has been part of virtually every project the famed guitarist has put together since 2000. They’ve recorded 8 albums together and 3 of them have been awarded the Grammy. He regularly collaborates with some of the today’s most prominent jazz musicians  such as Joshua Redman, Chris Potter, Christian McBride, John Patitucci, Donny McCaslin, Danilo Perez, David Sanchez, Paquito D'Rivera, Kenny Werner, Marcus Roberts, Avishai Cohen, Dee Dee Bridgewater, Dianne Reeves, Miguel Zenon, Scott Colley, Dave Samuels, Luciana Souza, Billy Childs, and Claudia Acuña just to name a few. Antonio’s continuous search as an artist has pushed him to compose and lead his own bands and ensembles. He has released 4 critically acclaimed albums under his name. His first one, 'Migration' was called “one of the best new releases of 2007” by All About Jazz and features a star studded cast which includes Pat Metheny, Chick Corea, Chris Potter, David Sanchez and Scott Colley. His second solo effort “Live in New York” was recored during a 4 day run at the prestigious Jazz Standard in New York City and features saxophone greats David Sanchez and Miguel Zenon as well as bassist Scott Colley. Antonio’s 2013 album 'New Life' was made entirely of his own compositions and was widely received by critics all over the world. It was the winner of the prestigious German Echo Jazz Award in 2014. Downbeat Magazine said: “New Life is that rare combination of great composing, great players and great musicianship” 2015 will see the release of two very distinct projects that are important milestones in Sanchez’s solo career: “Three Times Three”, a double album which features three stellar trios: Brad Mehldau and Matt Brewer, John Scofield and Christian McBride and last but not least Joe Lovano and John Patitucci. This record includes six original compositions and three standards arranged by Antonio. In 2013 Antonio was invited by acclaimed filmmaker Alejandro Gonzales Iñarritu (Amores Perros, 21 Grams, Babel, Biutiful) to create the original film score for his 2014 release “Birdman” (Fox Searchlight) featuring Michael Keaton, Edward Norton, Naomi Watts and Emma Thompson. This is a very unique project that features Sanchez’s drumming as the main musical ingredient in Iñarritu’s film. It won the Sound Stars Award for best Film Score at the 2014 Venice Film Festival and got nominated for the 2014 Hollywood Music in Media Awards for best original Film Score. Antonio's interest in education has taken him around the globe performing clinics, drum festivals and master classes. Some of these festivals include the 'Modern Drummer Festival Weekend', 'Zildjian Day' and the 'Montreal Drum Festival' among many others. He was also a professor at the prestigious New York University from 2006-2009 but had to stop due to his hectic touring schedule. He won the Modern Drummer Reader’s Poll for Best Jazz Drummer in 2013 and has been a top contender since the early 2000’s. He’s also been among the top ranked drummers on Downbeat’s critic’s and reader’s polls since 2004. In 2014, Sánchez composed the film score for Birdman.[2] The soundtrack album was released on October 14, 2014. The score earned him nominations for the Golden Globe Award for Best Original Score, BAFTA Award for Best Film Music, and other nominations; he won the Critics' Choice Movie Award for Best Score and Satellite Award for Best Original Score. However, he was disqualified to compete for the Academy Award for Best Original Score, since the film also contained a significant amount of classical music. Sánchez's 2017 album, Bad Hombre, earned him a Grammy Nomination for Best Contemporary Instrumental Album. He's endorsed by Yamaha Drums, Zildjian Cymbals and Sticks (Antonio Sanchez Signature model), Remo Drumheads and LP Percussion. He's made New York City his home since 1999.",
      "artwork" : ["antonio.jpg"]
    },{
      "index": 15,
      "name": "Dennis Chambers",
      "shortname" : "chambers",
      "description": "Dennis Chambers is a most respected American drummer who has recorded and performed with John Scofield, Carl Filipiak, Steely Dan, Santana, Parliament/Funkadelic, John McLaughlin, Niacin, Mike Stern, and many othe Dennis Chambers has become well-known among drummers for his impressive technique and speed. Dennis Chambers is particularly regarded for his ability to play 'in the pocket' but can also stretch very far out of the pocket which is also a hallmark of his technique. Chambers exhibits a powerful style that is technically proficient, yet highly musical and groove-oriented. He can play in a wide variety of musical genres, but is perhaps most notable for his jazz-fusion, funk, and Latin music playing. He is mostly known for his fast hands and triplets on the bass drum.Chambers began drumming at the age of four years old, and was gigging in Baltimore-area nightclubs by the age of six. In 1978 (at 18 years old) he joined Parliament/Funkadelic, and stayed with them until 1985. In the early 1990s he joined the John Scofield band. Since then he has played with most of the major figures in jazz fusion music. He has been part of the Maceo Parker live band and is touring with Carlos Santana and makes appearances with his band Niacin. In 2011 Chambers appeared as a featured drummer on the Late Show with David Letterman’s Drum Solo Week II 2005 till 2014: Santana - 2007: Tower Of Power - 2016: Mike Stern. In July 2014, Chambers experienced some medical issues which kept him out of the music scene for a number of months. He plays Pearl drums, Zildjian cymbals, Zildjian sticks,and Evans drumheads.",
      "artwork" : ["chambers.jpg"]
    }]
  }



